Revit 2026 API

# AnnotationSymbolremoveLeader Method

---

remove a leader of this annotation symbol.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void removeLeader()
```
```vb
Public Sub removeLeader
```
```cpp
public:
void removeLeader()
```
```fsharp
member removeLeader : unit -> unit
```

#### Reference

AnnotationSymbol Class

Autodesk.Revit.DB Namespace